//自运行匿名函数，形成闭包，避免污染全局
(function () {
    /*********************************************** seajs 配置 ***********************************************/
    seajs.config({
        //别名
        alias: {
            'jquery': 'lib/jquery'
        },
        //映射
        map: [
            [/^(.*)\.js$/i, '$1\.js?333']
        ],
        base: './js',
        charset: 'utf-8',
        timeout: 20000
    });

    /*******************************************  入口 ***********************************************/
    //使用模块，不以 点 或 杠 开通的路径，会与seajs.config 的 base拼接
    seajs.use(['router','business/top/unit/top']);
})();